DataProcessors/APPLIX_RU_СМ_ОПрограмме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>APPLIX_RU_СМ_ОПрограмме</Name>
			<Comment>applix.ru (c)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Р_Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ДатаОкончанияТП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ДемоРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИдентификаторПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_КлючАктивации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_НазваниеПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_НазваниеПрограммыПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ОписаниеЛицензии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ОписаниеПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Обновление_Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Обновление_Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Техподдержка_Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Техподдержка_СсылкаНаФорум</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Техподдержка_СсылкаНаСтраницу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Разработчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_КлючАктивации_ИмяКонстанты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИмяПараметраСеансаКэш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_КЭШ</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_Техподдержка_СсылкаНаЛицензионноеСоглашение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_Техподдержка_СсылкаНаТехподдержку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ВерсияПодсистемы</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/APPLIX_RU_СМ_ОПрограмме/Ext/ObjectModule.bsl
Процедура Объект_ЗаполнитьНачальныеНастройки() Экспорт
	Р_ИНФО_Разработчик = "APPLIX.RU - Профессиональная разработка приложений на базе 1С."
	+ Символы.ПС + "2002 - " + Формат(ТекущаяДата(), "ДФ=yyyy") + " (c)  Все права защищены.";
	
	Р_Техподдержка_СсылкаНаЛицензионноеСоглашение = APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/company/license/", "лицензионное_соглашение");
	Р_Техподдержка_СсылкаНаТехподдержку = "http://applix.ru/help/support/?utm_source=modul_1c&utm_medium=o_programme&utm_campaign=vygruzka_nomenklatury&utm_term=техподдержка";
	
	Объект_ЗаполнитьКэш();
КонецПроцедуры

Функция Объект_ЗаполнитьКэш() Экспорт
	
	Р_КЭШ = Новый Структура();
	
	// Список ссылок на товары
	СписокСсылокНаРазработки = Новый Соответствие();
	СписокСсылокНаРазработки.Вставить("ЭКСЕЛОН", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/product/master-zagruzki-excel-1c/", "экселон"));
	СписокСсылокНаРазработки.Вставить("ПАРСЕРЯМ", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/product/parser-yandex-market/", "парсер_ям"));
	СписокСсылокНаРазработки.Вставить("БОНЛИОН", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/product/bonlion/", "бонлион"));
	СписокСсылокНаРазработки.Вставить("ЭВОДОК", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/product/evodoc/", "эводок"));
	СписокСсылокНаРазработки.Вставить("ЭКСПОТОР", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/product/multiformatnaya-vygruzka-nomenklatury-1c/", "экспотор"));
	СписокСсылокНаРазработки.Вставить("ПРАЙС", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/product/1c-price-to-excel/", "прайс_в_excel"));
	СписокСсылокНаРазработки.Вставить("СМС", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/product/rassylka-sms-i-email-1s-8/", "смс_рассылка"));
	СписокСсылокНаРазработки.Вставить("БЛАНКИ", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/product/pechat-konvertov-pochtovykh-blankov-1s/", "бланки"));
	СписокСсылокНаРазработки.Вставить("АНАЛИЗЦЕН", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/product/analiz-tsen-postavshchikov-1c/", "анализ_цен"));
	СписокСсылокНаРазработки.Вставить("ХДВИ", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/product/khranenie-kartinok-tovarov-vo-vneshnem-kataloge/", "файлы_на_диске"));
	СписокСсылокНаРазработки.Вставить("СЛУЖЕБНЫЙМОДУЛЬ", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/product/service-tools/", "служебный_модуль"));
	СписокСсылокНаРазработки.Вставить("ВСЕРАЗРАБОТКИ", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/catalog/vse-razrabotki-dlya-1s/", "все_разработки"));
	
	СписокСсылокНаРазработки.Вставить("ЭТОТМОДУЛЬ", APPLIX_RU_ДобавитьUTMметкиКСсылке(Р_ИНФО_Техподдержка_СсылкаНаСтраницу, "этотмодуль"));
	СписокСсылокНаРазработки.Вставить("ФОРУМ", APPLIX_RU_ДобавитьUTMметкиКСсылке(Р_ИНФО_Техподдержка_СсылкаНаФорум, "форум"));
	СписокСсылокНаРазработки.Вставить("САЙТ", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru", "сайт"));
	СписокСсылокНаРазработки.Вставить("СОГЛАШЕНИЕ", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/company/license/", "лицензионное_соглашение"));
	СписокСсылокНаРазработки.Вставить("ТЕХПОДДЕРЖКА", APPLIX_RU_ДобавитьUTMметкиКСсылке("http://applix.ru/help/support/", "техподдержка"));
	
	СписокСсылокНаРазработки.Вставить("ИНСТАГРАМ", "https://www.instagram.com/applix.ru/");
	СписокСсылокНаРазработки.Вставить("ВК", "https://vk.com/applix_ru");
	СписокСсылокНаРазработки.Вставить("ФБ", "https://www.facebook.com/1c.applix.ru/");
	СписокСсылокНаРазработки.Вставить("ЮТУБ", "https://www.youtube.com/channel/UC7QjjanbKhl1VegpN_nturg/videos?disable_polymer=1");
	Р_КЭШ.Вставить("СписокСсылокНаРазработки", СписокСсылокНаРазработки);
	
	
	Возврат Р_КЭШ;
КонецФункции

//---------------------------------------------------------------------------------------------------------------------------------------
Функция APPLIX_RU_ДобавитьUTMметкиКСсылке(АдресСсылки, КлючевоеСлово="")
	Рез = АдресСсылки;
	
	Рез = Рез + "?utm_source=soft"; //из программы
	Рез = Рез + "&utm_medium=oprogramme"; // из какого раздела программы
	Рез = Рез + "&utm_campaign=" + Р_ИдентификаторПрограммы; // Из какой программы
	Рез = Рез + "&utm_term=" + КлючевоеСлово; 
	Рез = Рез + "&utm_content=soft";

	Возврат Рез;
КонецФункции


// СЛУЖЕБНЫЕ //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


Функция APPLIX_RU_ПолучитьИмяЭтойОбработки() Экспорт
	Возврат Метаданные().Имя;
КонецФункции


Функция APPLIX_RU_ПолучитьМакетОбработки(ИмяМакета) Экспорт 
	Попытка
		Макет = ПолучитьМакет(ИмяМакета);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Если ТипЗнч(Макет)=Тип("ТабличныйДокумент") Тогда
		АдресФайла = ПоместитьВоВременноеХранилище(Макет);
		Возврат АдресФайла;
	КонецЕсли;
	
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
		
	Попытка
		Макет.Записать(ИмяФайла);
		АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
		Возврат АдресФайла;
	Исключение
	КонецПопытки;
	
	//т = Новый ТекстовыйДокумент;
	//Попытка
	//	т.УстановитьТекст(Макет.ПолучитьТекст());
	//	т.Записать(ИмяФайла);
	//Исключение
	//КонецПопытки;
	
	Попытка
		АдресФайла = ПоместитьВоВременноеХранилище(Макет.ПолучитьТекст());
		Возврат АдресФайла;
	Исключение
	КонецПопытки;
	
	Возврат АдресФайла;
КонецФункции
